// Tuniu.cpp: implementation of the Tuniu class.
//
//////////////////////////////////////////////////////////////////////

#include "stdafx.h"
#include "Tuniu.h"

#ifdef _DEBUG
#undef THIS_FILE
static char THIS_FILE[]=__FILE__;
#define new DEBUG_NEW
#endif

//////////////////////////////////////////////////////////////////////
// Construction/Destruction
//////////////////////////////////////////////////////////////////////
char* air_code[][2] = {{"402","福州"},
{"2705","汉中"},
{"3320","迪庆"},
{"1513","永州"},
{"42632","且末县"},
{"2603","长治"},
{"42572","德令哈市"},
{"505","敦煌市"},
{"3304","保山"},
{"108","阜阳"},
{"1013","唐山"},
{"3207","日喀则"},
{"42121","黎平县"},
{"2613","运城"},
{"40645","抚远县"},
{"109","池州"},
{"42191","宁蒗彝族自治县"},
{"103","安庆"},
{"2411","临沂"},
{"703","百色"},
{"2602","太原"},
{"2415","日照"},
{"508","酒泉"},
{"42031","稻城县"},
{"905","琼海市"},
{"1713","宜春"},
{"3102","乌鲁木齐"},
{"1704","赣州"},
{"40373","乌兰浩特市"},
{"1804","白山"},
{"808","铜仁"},
{"2109","巴彦淖尔"},
{"902","海口"},
{"40350","满洲里市"},
{"506","甘南"},
{"2203","固原"},
{"40342","海拉尔区"},
{"2810","广元"},
{"2811","九寨沟县"},
{"3324","芒市"},
{"40547","延吉市"},
{"2419","烟台"},
{"3118","吐鲁番"},
{"619","深圳"},
{"3205","林芝"},
{"1015","邢台"},
{"2828","西昌市"},
{"1002","石家庄"},
{"2825","宜宾"},
{"40394","额济纳旗"},
{"625","湛江"},
{"1619","无锡"},
{"315","黔江区"},
{"3104","阿勒泰"},
{"1622","扬州"},
{"102","合肥"},
{"614","梅州"},
{"616","汕头"},
{"1111","齐齐哈尔"},
{"705","桂林"},
{"40374","阿尔山市"},
{"1203","安阳"},
{"1506","怀化"},
{"1416","襄阳"},
{"514","庆阳"},
{"40380","锡林浩特市"},
{"42015","康定县"},
{"41911","广汉市"},
{"3110","和田"},
{"3318","西双版纳"},
{"3203","阿里"},
{"1514","张家界"},
{"408","泉州"},
{"42628","库尔勒市"},
{"2904","台南"},
{"2406","东营"},
{"3112","克拉玛依"},
{"2816","绵阳"},
{"1108","佳木斯"},
{"1016","张家口"},
{"1903","鞍山"},
{"3424","台州"},
{"1102","哈尔滨"},
{"511","天水"},
{"1906","大连"},
{"1202","郑州"},
{"3317","文山"},
{"1418","宜昌"},
{"40393","阿拉善右旗"},
{"1505","衡阳"},
{"2105","赤峰"},
{"707","河池"},
{"507","金昌"},
{"2206","中卫"},
{"1706","景德镇"},
{"515","张掖"},
{"2408","济宁"},
{"40163","三河市"},
{"2413","青岛"},
{"602","广州"},
{"1502","长沙"},
{"1610","连云港"},
{"2906","高雄"},
{"906","三亚"},
{"2804","达州"},
{"3111","喀什"},
{"2310","玉树"},
{"302","万州区"},
{"2711","延安"},
{"3000","天津"},
{"1708","九江"},
{"1115","伊春"},
{"1808","吉林"},
{"787136","马公"},
{"1109","鸡西"},
{"3419","衢州"},
{"2712","榆林"},
{"3316","普洱"},
{"711","梧州"},
{"609","惠州"},
{"3103","阿克苏"},
{"1503","常德"},
{"40414","长海县"},
{"40379","二连浩特市"},
{"40392","阿拉善左旗"},
{"42691","富蕴县"},
{"2610","忻州"},
{"2608","临汾"},
{"911","东方市"},
{"2102","呼和浩特"},
{"2814","泸州"},
{"3204","昌都"},
{"1702","南昌"},
{"809","黔西南"},
{"104","蚌埠"},
{"704","北海"},
{"1911","锦州"},
{"1621","盐城"},
{"1606","淮安"},
{"1611","南通"},
{"2604","大同"},
{"803","安顺"},
{"1915","营口"},
{"404","龙岩"},
{"40810","义乌市"},
{"618","韶关"},
{"1012","秦皇岛"},
{"200","北京"},
{"1211","南阳"},
{"42672","伊宁市"},
{"1210","洛阳"},
{"2820","攀枝花"},
{"42639","库车县"},
{"709","柳州"},
{"3427","舟山"},
{"1602","南京"},
{"409","三明"},
{"3306","大理"},
{"1408","荆州"},
{"702","南宁"},
{"3109","哈密"},
{"811","遵义"},
{"2418","威海"},
{"1403","恩施"},
{"802","贵阳"},
{"785259","花莲市"},
{"42668","策勒县"},
{"1412","神农架"},
{"3311","临沧"},
{"3426","温州"},
{"2500","上海"},
{"2111","乌海"},
{"807","六盘水"},
{"1811","通化"},
{"42111","凯里市"},
{"1008","邯郸"},
{"1104","大庆"},
{"502","兰州"},
{"2802","成都"},
{"2106","鄂尔多斯"},
{"3116","石河子"},
{"1410","十堰"},
{"1905","朝阳"},
{"516","嘉峪关"},
{"3202","拉萨"},
{"1604","常州"},
{"414","厦门"},
{"804","毕节"},
{"805","黔南"},
{"413","武夷山市"},
{"1110","牡丹江"},
{"42678","新源县"},
{"3312","丽江"},
{"2607","吕梁"},
{"3117","塔城"},
{"2402","济南"},
{"42014","红原县"},
{"3323","腾冲县"},
{"2703","安康"},
{"41723","龙川县"},
{"2302","西宁"},
{"3402","杭州"},
{"2110","通辽"},
{"1107","黑河"},
{"2104","包头"},
{"1707","井冈山市"},
{"2202","银川"},
{"787140","望安"},
{"1402","武汉"},
{"3415","宁波"},
{"40679","漠河县"},
{"42571","格尔木市"},
{"2905","台中"},
{"787149","台东"},
{"2918","金门"},
{"2702","西安"},
{"2818","南充"},
{"42624","博乐市"},
{"1003","保定"},
{"3321","昭通"},
{"1802","长春"},
{"3302","昆明"},
{"1105","大兴安岭"},
{"2417","潍坊"},
{"1907","丹东"},
{"1902","沈阳"},
{"1620","徐州"},
{"113","黄山"},
{"607","佛山"},
{"300","重庆"},
{"628","珠海"}};

char* train_code[][2] = {{"3103","阿克苏"},
{"2703","安康"},
{"41476","安陆"},
{"103","安庆"},
{"1903","鞍山"},
{"803","安顺"},
{"1203","安阳"},
{"1803","白城"},
{"1003","保定"},
{"2704","宝鸡"},
{"2104","包头"},
{"40453","鲅鱼圈"},
{"2803","巴中"},
{"40043","北戴河"},
{"704","北海"},
{"200","北京"},
{"104","蚌埠"},
{"42624","博乐"},
{"40788","苍南"},
{"1005","沧州"},
{"1802","长春"},
{"1503","常德"},
{"1502","长沙"},
{"2603","长治"},
{"1604","常州"},
{"106","巢湖"},
{"604","潮州"},
{"1006","承德"},
{"2802","成都"},
{"1504","郴州"},
{"41501","赤壁"},
{"2105","赤峰"},
{"300","重庆"},
{"107","滁州"},
{"3306","大理"},
{"1906","大连"},
{"1907","丹东"},
{"1104","大庆"},
{"2604","大同"},
{"2804","达州"},
{"42572","德令哈"},
{"3432","德清"},
{"2805","德阳"},
{"2405","德州"},
{"40899","定远"},
{"606","东莞"},
{"40728","东海县"},
{"40334","东胜"},
{"2406","东营"},
{"41886","都江堰"},
{"505","敦煌"},
{"41910","德阳"},
{"40394","额济纳"},
{"2807","峨眉"},
{"1403","恩施"},
{"1404","鄂州"},
{"607","佛山"},
{"41025","福安"},
{"41026","福鼎"},
{"303","涪陵"},
{"40954","福清"},
{"1908","抚顺"},
{"1909","阜新"},
{"108","阜阳"},
{"402","福州"},
{"1703","抚州"},
{"1704","赣州"},
{"41181","高密"},
{"42571","格尔木"},
{"2809","广安"},
{"2810","广元"},
{"602","广州"},
{"705","桂林"},
{"802","贵阳"},
{"40424","海城"},
{"902","海口"},
{"40342","海拉尔"},
{"40796","海宁"},
{"3109","哈密"},
{"1008","邯郸"},
{"3402","杭州"},
{"40963","涵江"},
{"2705","汉中"},
{"1102","哈尔滨"},
{"1204","鹤壁"},
{"339","合川"},
{"102","合肥"},
{"1106","鹤岗"},
{"1107","黑河"},
{"41542","衡山"},
{"1009","衡水"},
{"1505","衡阳"},
{"2407","菏泽"},
{"1606","淮安"},
{"110","淮北"},
{"1506","怀化"},
{"112","淮南"},
{"113","黄山"},
{"1406","黄石"},
{"2102","呼和浩特"},
{"609","惠州"},
{"1910","葫芦岛"},
{"3409","湖州"},
{"503","酒泉"},
{"1108","佳木斯"},
{"1705","吉安"},
{"610","江门"},
{"3420","江山"},
{"41139","胶州"},
{"3434","嘉善"},
{"3410","嘉兴"},
{"516","嘉峪关"},
{"611","揭阳"},
{"1808","吉林"},
{"1800","吉林"},
{"2402","济南"},
{"2606","晋城"},
{"1706","景德镇"},
{"1419","荆门"},
{"1408","荆州"},
{"3411","金华"},
{"2408","济宁"},
{"40362","集宁"},
{"40989","晋江"},
{"1911","锦州"},
{"1517","吉首"},
{"1708","九江"},
{"508","酒泉"},
{"1109","鸡西"},
{"1208","开封"},
{"42111","凯里"},
{"3111","喀什"},
{"42628","库尔勒"},
{"3302","昆明"},
{"1631","昆山"},
{"1010","廊坊"},
{"502","兰州"},
{"1518","耒阳"},
{"3202","拉萨"},
{"323","梁平"},
{"40949","连江"},
{"1610","连云港"},
{"2410","聊城"},
{"1912","辽阳"},
{"1806","辽源"},
{"3312","丽江"},
{"2608","临汾"},
{"904","陵水"},
{"3413","临海"},
{"40355","临河"},
{"2411","临沂"},
{"115","六安"},
{"807","六盘水"},
{"709","柳州"},
{"1630","溧阳"},
{"404","龙岩"},
{"40817","龙游"},
{"1508","娄底"},
{"1209","漯河"},
{"1210","洛阳"},
{"40950","罗源"},
{"1709","庐山"},
{"2607","吕梁"},
{"116","马鞍山"},
{"40350","满洲里"},
{"41864","美兰"},
{"614","梅州"},
{"2816","绵阳"},
{"41565","汨罗"},
{"40679","漠河"},
{"1110","牡丹江"},
{"1702","南昌"},
{"41101","南城"},
{"2818","南充"},
{"41103","南丰"},
{"1602","南京"},
{"702","南宁"},
{"1611","南通"},
{"1211","南阳"},
{"2819","内江"},
{"3415","宁波"},
{"406","宁德"},
{"3437","宁海"},
{"1913","盘锦"},
{"2820","攀枝花"},
{"1212","平顶山"},
{"1710","萍乡"},
{"2614","平遥"},
{"407","莆田"},
{"40040","迁安"},
{"315","黔江"},
{"1409","潜江"},
{"41492","蕲春"},
{"2413","青岛"},
{"615","清远"},
{"41178","青州市"},
{"1012","秦皇岛"},
{"905","琼海"},
{"1111","齐齐哈尔"},
{"1112","七台河"},
{"408","泉州"},
{"2423","曲阜"},
{"3315","曲靖"},
{"41985","渠县"},
{"3419","衢州"},
{"40152","任丘"},
{"2415","日照"},
{"1643","如皋"},
{"40791","瑞安"},
{"41203","乳山"},
{"1214","三门峡"},
{"40826","三门县"},
{"409","三明"},
{"906","三亚"},
{"2500","上海"},
{"1215","商丘"},
{"1711","上饶"},
{"40803","上虞"},
{"40042","山海关"},
{"616","汕头"},
{"618","韶关"},
{"3422","绍兴"},
{"1509","邵阳"},
{"42419","神木"},
{"1902","沈阳"},
{"619","深圳"},
{"1002","石家庄"},
{"1410","十堰"},
{"1113","双鸭山"},
{"1809","四平"},
{"2517","松江"},
{"1810","松原"},
{"41485","松滋"},
{"42424","绥德"},
{"40658","绥芬河"},
{"2821","遂宁"},
{"1411","随州"},
{"1615","苏州"},
{"117","宿州"},
{"2416","泰安"},
{"40422","台安"},
{"40976","泰宁"},
{"2602","太原"},
{"3424","台州"},
{"1617","泰州"},
{"1013","唐山"},
{"41155","滕州"},
{"3000","天津"},
{"1407","天门"},
{"511","天水"},
{"1914","铁岭"},
{"40888","桐城"},
{"1811","通化"},
{"2110","通辽"},
{"118","铜陵"},
{"808","铜仁"},
{"3431","桐乡"},
{"3118","吐鲁番"},
{"40415","瓦房店"},
{"908","万宁"},
{"41986","万源"},
{"302","万州"},
{"2417","潍坊"},
{"2418","威海"},
{"2706","渭南"},
{"909","文昌"},
{"40829","温岭"},
{"3426","温州"},
{"2111","乌海"},
{"1402","武汉"},
{"120","芜湖"},
{"40373","乌兰浩特"},
{"327","武隆"},
{"3102","乌鲁木齐"},
{"3012","武清"},
{"513","武威"},
{"1619","无锡"},
{"413","武夷山"},
{"414","厦门"},
{"2702","西安"},
{"1416","襄阳"},
{"1414","咸宁"},
{"1417","孝感"},
{"41019","霞浦"},
{"2828","西昌"},
{"40380","锡林浩特"},
{"1015","邢台"},
{"2302","西宁"},
{"1216","新乡"},
{"1217","信阳"},
{"1712","新余"},
{"2610","忻州"},
{"1218","许昌"},
{"1620","徐州"},
{"40792","乐清"},
{"2711","延安"},
{"1621","盐城"},
{"2611","阳泉"},
{"1622","扬州"},
{"40547","延吉"},
{"2419","烟台"},
{"2825","宜宾"},
{"1418","宜昌"},
{"1713","宜春"},
{"2202","银川"},
{"41737","英德"},
{"1915","营口"},
{"41954","营山"},
{"1714","鹰潭"},
{"40810","义乌"},
{"1628","宜兴"},
{"1511","益阳"},
{"40786","永嘉"},
{"1513","永州"},
{"40973","尤溪"},
{"1512","岳阳"},
{"40772","余杭"},
{"2712","榆林"},
{"2613","运城"},
{"40780","余姚"},
{"41462","枣阳"},
{"2420","枣庄"},
{"1514","张家界"},
{"1016","张家口"},
{"41131","章丘"},
{"515","张掖"},
{"415","漳州"},
{"625","湛江"},
{"3321","昭通"},
{"1202","郑州"},
{"1626","镇江"},
{"42115","镇远"},
{"42106","织金"},
{"627","中山"},
{"2206","中卫"},
{"41471","钟祥"},
{"1219","周口"},
{"628","珠海"},
{"3428","诸暨"},
{"1220","驻马店"},
{"1515","株洲"},
{"2421","淄博"},
{"811","遵义"}};

string train_code2name(string scode)
{

	for (int iCode = 0; iCode < sizeof(train_code)/sizeof(train_code[0]); iCode ++)
	{
		if (scode.compare(train_code[iCode][0]) == 0)
		{
			return train_code[iCode][1];
		}
	}
	
	return scode;
}


string air_code2name(string scode)
{
	
	for (int iCode = 0; iCode < sizeof(air_code)/sizeof(air_code[0]); iCode ++)
	{
		if (scode.compare(air_code[iCode][0]) == 0)
		{
			return air_code[iCode][1];
		}
	}
	
	return scode;
}

Tuniu::Tuniu(HttpSession *http_session, const string &pro_name) : Traffic(http_session, pro_name)
{

}

Tuniu::~Tuniu()
{

}

int Tuniu::Is(HttpSession *http_session)
{
	// PC 火车票
	if((http_session->m_Requestline.m_Host.Find("huoche.tuniu.com")!=-1) && 
		(http_session->m_Requestline.m_URI.Find("/yii.php?r=train/TrainTicket/SaveOrder")!=-1))
	{
		return PC_TRAIN;
	}
	// PC 飞机票
	if((http_session->m_Requestline.m_Host.Find("flight.api.tuniu.com")!=-1) && 
		(http_session->m_Requestline.m_URI.Find("/user-login/saveOrderPost")!=-1))
	{
		return PC_AIRPLANE;
	}
	// SP 汽车票
	if((http_session->m_Requestline.m_Host.Find("dynamic.m.tuniu.com")!=-1) && 
		(http_session->m_Requestline.m_URI.Find("/api/coach/order/addOrder")!=-1))
	{
		return SP_BUS;
	}
	// SP 火车票
	if((http_session->m_Requestline.m_Host.Find("dynamic.m.tuniu.com")!=-1) && 
		(http_session->m_Requestline.m_URI.Find("/api/train/order/AddOrder")!=-1))
	{
		return SP_TRAIN;
	}
	// SP 飞机票
	if((http_session->m_Requestline.m_Host.Find("flight.api.tuniu.com")!=-1) && 
		(http_session->m_Requestline.m_URI.Find("/app/user-login/saveOrder")!=-1))
	{
		return SP_AIRPLANE;
	}
	return 0;
}

int Tuniu::Process(const char *packet,int action)
{
	if (action == PC_TRAIN)
	{
		string sContent = ms_->UrlDecode(packet);
		char* cur_pos = (char*)sContent.c_str();
		tel_     = middle_text(sContent.c_str(), "contactsInfo[tel]=", "&", &cur_pos);
		number_  = middle_text(sContent.c_str(), "\"TrainName\":\"", "\"", &cur_pos);
		time_    = middle_text(sContent.c_str(), "\"DepartureDate\":\"", "\"", &cur_pos) + " " + middle_text(sContent.c_str(), "\"DepartureTime\":\"", "\"", &cur_pos);		
		start_   = middle_text(sContent.c_str(), "\"DepartureStation\":\"", "\"", &cur_pos);
		end_     = middle_text(sContent.c_str(), "\"ArrivalStation\":\"", "\"", &cur_pos);
		name_    = middle_text(sContent.c_str(), "[username]=", "&", &cur_pos);
		cardid_  = middle_text(sContent.c_str(), "[psptId]=", "&", &cur_pos);
		price_  = middle_text(sContent.c_str(), "price=", "&", &cur_pos);
		type_   = "火车票";
		Write();	
		return 0;
	}
	if (action == PC_AIRPLANE)
	{
		// 此处需要将 unicode码转换成 汉字
		string sContent = ms_->UrlDecode(packet);
		char* cur_pos = NULL;	
		tel_     = middle_text(sContent.c_str(), "\"tel\":\"", "\"", &cur_pos);
		number_  = middle_text(sContent.c_str(), "\"CoachNo\":\"", "\"", &cur_pos);
		time_    = middle_text(sContent.c_str(), "\"startDate\":\"", "\"", &cur_pos);
        start_   = middle_text(sContent.c_str(), "\"startCityCode\":\"", "\"", &cur_pos);
		end_     = middle_text(sContent.c_str(), "\"desCityCode\":\"", "\"", &cur_pos);
		name_    = middle_text(sContent.c_str(), "\"name\":\"", "\"", &cur_pos);
		cardid_  = middle_text(sContent.c_str(), "\"psptId\":\"", "\"", &cur_pos);
		price_   = middle_text(sContent.c_str(), "\"adultPrice\":", ",", &cur_pos);
		type_    = "飞机票";
		start_ = air_code2name(start_);
		end_   = air_code2name(end_);
		Write();
		return 0;
	}
	if (action == SP_BUS)
	{
		// 此处需要将 unicode码转换成 汉字
		string sContent = ms_->UrlDecode(packet);
		char* cur_pos = NULL;	
		tel_     = middle_text(sContent.c_str(), "\"tel\":\"", "\"", &cur_pos);
		number_  = middle_text(sContent.c_str(), "\"trainNumber\":\"", "\"", &cur_pos);
		time_    = middle_text(sContent.c_str(), "\"departDate\":\"", "\"", &cur_pos);
        start_   = middle_text(sContent.c_str(), "\"departureCityName\":\"", "\"", &cur_pos) + "(" + middle_text(sContent.c_str(), "\"departureStationName\":\"", "\"", &cur_pos) + ")";
		end_     = middle_text(sContent.c_str(), "\"arrivalCityName\":\"", "\"", &cur_pos) + "(" + middle_text(sContent.c_str(), "\"arrivalStationName\":\"", "\"", &cur_pos) + ")";
		name_    = middle_text(sContent.c_str(), "\"name\":\"", "\"", &cur_pos);
		cardid_  = middle_text(sContent.c_str(), "\"psptId\":\"", "\"", &cur_pos);
		price_   = middle_text(sContent.c_str(), "\"adultPrice\":", ",", &cur_pos);
		type_    = "汽车票";	
		Write();		
		return 0;	
	}
	if (action == SP_TRAIN)
	{
		// 此处需要将 unicode码转换成 汉字
		string sContent = ms_->UrlDecode(packet);
		char* cur_pos = NULL;
		tel_     = middle_text(sContent.c_str(), "\"tel\":\"", "\"", &cur_pos);
		number_  = middle_text(sContent.c_str(), "\"trainNumber\":\"", "\"", &cur_pos);
		time_    = middle_text(sContent.c_str(), "\"departDate\":\"", "\"", &cur_pos);
        start_   = middle_text(sContent.c_str(), "\"departureCityName\":\"", "\"", &cur_pos) + "(" + middle_text(sContent.c_str(), "\"departureStationName\":\"", "\"", &cur_pos) + ")";
		end_     = middle_text(sContent.c_str(), "\"arrivalCityName\":\"", "\"", &cur_pos) + "(" + middle_text(sContent.c_str(), "\"arrivalStationName\":\"", "\"", &cur_pos) + ")";
		name_    = middle_text(sContent.c_str(), "\"name\":\"", "\"", &cur_pos);
		cardid_  = middle_text(sContent.c_str(), "\"psptId\":\"", "\"", &cur_pos);
		price_   = middle_text(sContent.c_str(), "\"adultPrice\":", ",", &cur_pos);
		type_    = "火车票";
		Write();
		return 0;
	}
	if (action == SP_AIRPLANE)
	{
		// 此处需要将 unicode码转换成 汉字
		string sContent = ms_->UrlDecode(packet);
		char* cur_pos = NULL;		
		tel_     = middle_text(sContent.c_str(), "\"tel\":\"", "\"", &cur_pos);
		number_  = middle_text(sContent.c_str(), "\"CoachNo\":\"", "\"", &cur_pos);
		time_    = middle_text(sContent.c_str(), "\"departDate\":\"", "\"", &cur_pos);
        start_   = middle_text(sContent.c_str(), "\"orgCityCode\":", ",", &cur_pos);
		end_     = middle_text(sContent.c_str(), "\"dstCityCode\":", ",", &cur_pos);
		name_    = middle_text(sContent.c_str(), "\"name\":\"", "\"", &cur_pos);
		cardid_  = middle_text(sContent.c_str(), "\"psptId\":\"", "\"", &cur_pos);
		price_   = middle_text(sContent.c_str(), "\"adultPrice\":", ",", &cur_pos);
		type_    = "飞机票";
		Write();
		return 0;
	}
	return 0; 
}
